Revit 2024 API
Duct.Create Method
Overload List
Name | Description
Create(Document, ElementId, ElementId, Connector, Connector)
 Creates a new duct that connects to two connectors.
Create(Document, ElementId, ElementId, Connector, XYZ)
 Creates a new duct that connects to the connector.
Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ)
 Creates a new duct from two points.
See Also
Duct Class
Duct Members
Autodesk.Revit.DB.Mechanical Namespace